ERM/src/InformationRegisters/EmailsObjects.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>EmailsObjects</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Invoice</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.EMails</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/InformationRegisters/EmailsObjects/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗарегистрироватьПредметыПисьма(Email, Предметы, MailType) Экспорт
	
	НЗ = РегистрыСведений.EmailsObjects.СоздатьНаборЗаписей();
	
	Для каждого ТекПредмет Из Предметы Цикл
		ЗаписьНабора = НЗ.Добавить();
		ЗаписьНабора.Email = Email;
		ЗаписьНабора.Предмет = ТекПредмет;
		ЗаписьНабора.MailType = MailType;
	КонецЦикла;
	
	НЗ.Записать(Ложь);
	
КонецПроцедуры

#КонецЕсли
